Tekla Open API Reference for Tekla Structures 2025
HyperLink Constructor (ViewBase, Point, Uri, String)
 Creates a new hyperlink instance using standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public HyperLink(
	ViewBase View,
	Point InsertionPoint,
	Uri Target,
	string Text
)
Public Sub New (
	View As ViewBase,
	InsertionPoint As Point,
	Target As Uri,
	Text As String
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
A drawing view.
InsertionPoint
Type: Tekla.Structures.Geometry3d.Point
The location for the link.
Target
Type: System.Uri
The link target.
Text
Type: System.String
The link text visible to the user.
See Also
Reference
HyperLink Class
HyperLink Overload
Tekla.Structures.Drawing Namespace